Tekla Open API Reference for Tekla Structures 2025
Rectangle Constructor
Overload List
Name | Description
Rectangle(ViewBase, Point, Point)
 Creates a new rectangle instance with two points using standard attributes. Please note that creating a rectangle using two points will re-calculate the start point to correspond with positive widths and heights.
Rectangle(ViewBase, Point, Double, Double)
 Creates a new rectangle instance with the start point and the defined width and height using standard attributes.
Rectangle(ViewBase, Point, Point, Rectangle.RectangleAttributes)
 Creates a new rectangle instance with two points using the given attributes. Please note that creating a rectangle using two points will re-calculate the start point to correspond with positive widths and heights.
Rectangle(ViewBase, Point, Double, Double, Rectangle.RectangleAttributes)
 Creates a new rectangle instance with the start point and the defined width and height using the given attributes.
Top
See Also
Reference
Rectangle Class
Tekla.Structures.Drawing Namespace